[
    {
        "name": "Thorin Oakenshield",
        "description": " In the year TA 2746, Thorin II was born to Dwarven prince Thráin II in the mountain city of The Lonely Mountain. Early in his youth, he and the other Dwarves of the Lonely Mountain were forced to flee bythe dragon Smaug in TA 2770. While in exile, he quickly grew to become a capable warrior. This was demonstrated when he participated in the Battle of Azanulbizar in TA 2799. He marched with one of the Dwarven armies beneath the East-gate of Moria. At some point in the fighting, his shield broke, and using an oaken tree branch found on the floor as a shield, he gained the epithet 'Oakenshield,'' which would remain with him even in death.",
        "image_source": "https://upload.wikimedia.org/wikipedia/en/e/ed/Thorin%2C_from_the_Hobbit.jpg",
        "url" : "throin"
    },
    
    {
        "name": "Fili &amp; Kili",
        "description": "Fíli and Kíli were nephews of Thorin, who was the elder brother of their mother Dís. They were also nephews of Frerin, grandsons ofThráin II, and great-grandsons of Thror. Fíli's most distinguishing feature was his long nose, the longest of any of the Dwarves on the Quest of Erebor",
        "image_source": "https://vignette2.wikia.nocookie.net/lotr/images/b/b4/The-Hobbit-Fili-and-Kili.jpg/revision/latest?cb=20110714202952",
        "url" : "fili-and-kili"    
        
    },
    
    {
        "name": "Óin",
        "description": "Óin was the older brother of Glóin, cousin of Dwalin and Balin, and uncle of Gimli. He usually wore a brown-hooded cloak when travelling. Óin fought in the Battle of Azanulbizar along with Thorin Oakenshield, and in TA 2941 joined with Thorin and Company on the quest to reclaim the Lonely Mountain wearing a brown hood.[2] Óin was one of the Dwarves who bet that Bilbo would come along with them to reclaim the Lonely Mountain. Óin and his brother Glóin were usually in charge of preparing the fire for the Company. He fought in and survived the Battle of the Five Armies, and later settled in the Lonely Mountain along with many other of the Dwarves of The Company of Thorin such as Bombur.",
        "image_source": "https://vignette.wikia.nocookie.net/lotr/images/2/20/Oin_2.jpg/revision/latest?cb=20120909101940",
        "url" : "oin"
    },
    
    {
        "name": "Gloin",
        "description": "In TA 2799, Glóin was known to have fought in the Battle of Azanulbizar, the last battle of the War of the Dwarves and Orcs. In TA 2941, Glóin and his brother Óin, along with his cousinsDwalin and Balin, were among the Dwarves accompanying Thorin and Company during their quest to the Lonely Mountain to recapture it from the Dragon Smaug. He was noted for his skills with a tinderbox, and, along with his brother Óin, was usually the one told to get a fire started whenever the Dwarves made camp. Gloin also fought in the Battle of the Five Armies.[1] After the battle,he settled in the Lonely Mountain.",
        "image_source": "https://vignette.wikia.nocookie.net/lotr/images/f/fc/Gloin_2.jpg/revision/latest?cb=20120908171710",
        "url" : "gloin"
    },
    
    {
        "name": "Balin",
        "description": "Balin was a Dwarf, son of Fundin, and likely born in the Lonely Mountain before the coming of Smaug the Dragon. He had a younger brother named Dwalin and was one of those driven from their homes when the dragon Smaug attacked the Lonely Mountain. Afterwards he may have lived in Dunland as a refugee. He fought in the War of the Dwarves and Orcs. Many years later, in approximately TA 2841, he accompanied Thráin II, the father of Thorin, when he attempted to go back to the Lonely Mountain himself, but Thráin was captured and lost.",
        "image_source": "https://vignette.wikia.nocookie.net/lotr/images/5/52/Balin.jpg/revision/latest?cb=20120911171656",
        "url" : "balin"
    },
    
    {
        "name": "Dwalin",
        "description": "Born in TA 2772, two years after the dragon Smaug had come to Erebor and took over the Kingdom, Dwalin was the son of Fundin and younger brother of Balin (though he is taller). After fighting in the Battle of Azanulbizar at the age of 27, Dwalin accompanied Thrain the Second and Thorin Oakenshield to settle peacefully in the northern Ered Luin",
        "image_source": "https://vignette.wikia.nocookie.net/lotr/images/1/1c/Dwalin.jpg/revision/latest?cb=20120911200601",
        "url" : "dwalin"
    },
    
    {
        "name": "Ori",
        "description": "Ori lived in Thorin's home in the Northern Blue Mountains for many years. In the year TA 2941, Ori became a member of Thorin and Company and travelled with the company on the quest for the Lonely Mountain and the death of Smaug. Finally, he and the other Dwarves of Thorin and Company fought in the Battle of the Five Armies, and he survived it",
        "image_source": "https://78.media.tumblr.com/572fa2ca665b9719eeee546e13658cec/tumblr_mhe3rjgbmV1qghdd4o1_1280.jpg",
        "url" : "ori"
    },
    
    {
        "name": "Dori",
        "description": "Dori was a Dwarf of Durin's Folk, who along with his brothers Nori and Ori travelled with Bilbo Baggins as a member of Thorin and Company in The Quest of Erebor to reclaim the Lonely Mountain from the Dragon Smaug. Dori had a flute that he played in Bilbo's home before leaving on their journey. He was said to like food as much as Bilbo or any hobbit, and was described by the narrative as 'a decent fellow, despite his grumbling.'' Dori was the strongest of the company of Dwarves. He usually wore a purple-hooded cloak when traveling abroad.",
        "image_source": "https://i.pinimg.com/originals/32/1d/c4/321dc46eade36485e61c56db39a4d4c0.jpg",
        "url" : "dori"
    },
    
    {
        "name": "Nori",
        "description": "Nori was a Dwarf of Durin's folk who lived in the northern Blue Mountains in Thorin's Halls and later the restored Lonely Mountain. He had two brothers named Dori and Ori, and was a remote kinsman of Thorin Oakenshield. His hood was purple, he played the flute,  and he was very fond of regular and plentiful meals like his hobbit friend, Bilbo Baggins.",
        "image_source": "https://atolkienistperspective.files.wordpress.com/2013/08/n1.jpg",
        "url" : "nori"
    },
    
    {
        "name": "Difur",
        "description": "Whilst he was a descendant of the Dwarves of Khazad-dûm, Bifur was not of Durin's Folk. Most of his familial relations are unclear, and what is known of his parentage is very little. He and his family were driven out of their home in the Lonely Mountain by the Dragon Smaug, and were forced to live in exile, where the Dwarf warrior worked as a toy maker. Following Thorin II Oakenshield to a new life in the Blue Mountains, he continued his life as a toy maker.",
        "image_source": "https://vignette.wikia.nocookie.net/lotr/images/7/73/Bifur_2.jpg/revision/latest?cb=20120911201025",
        "url" : "difur"
    },
    
    {
        "name": "Bofur",
        "description": "Bofur was a descendant of the Dwarves of Khazad-dûm, but was not of Durin's Folk. He and his family hailed from the Blue Mountains. As such, they felt less strongly about the quest to reclaim the Lonely Mountain from the dragon Smaug, more interested in the  adventure than a home they'd never seen.",
        "image_source": "https://vignette.wikia.nocookie.net/lotr/images/5/56/Bofur_Nesbitt.jpg/revision/latest?cb=20121030120400",
        "url" : "bofur"
    },
    
    {
        "name": "Bombur",
        "description": "Bombur's parentage is unknown; the only familial connections mentioned are his brother Bofur and his cousin Bifur. Bombur was not of Durin's line although he was descended from Dwarves of Moria. His birth year is also unknown, however, from Bilbo Baggins' account from the quest to Erebor it is known that the brothers Fíli and Kíli were the youngest of the 13 'by some fifty years' and that after Thorin had been captured, Balin was 'the  eldest left'. Since Fíli was born in T.A. 2859 and Balin was born in T.A. 2763, this would put Bombur's birth between 2763 and 2809, and he would have been between 132 and 178 years old during the quest to Erebor. Prior to the quest Bombur probably lived in the Blue Mountains with Thorin after the loss of Thráin II.",
        "image_source": "https://vignette.wikia.nocookie.net/lotr/images/e/ed/Bombur.jpg/revision/latest?cb=20121030115452",
        "url" : "bombur"
    },
    
    {
        "name": "Gandalf",
        "description": "Originally called Olórin, he was accounted as the wisest of the Maiar (with the possible exception of Melian). He was a Maia of Manwë and Varda. He also served under two other Valar, such as Irmo and Nienna. When the Valar decided to send the order of the Istari (also known as Wizards) to Middle-earth, to counsel and assist all those in Middle-earth who opposed the Dark Lord Sauron, Manwë and Varda decided to include Olórin among the five who were sent.",
        "image_source": "https://vignette.wikia.nocookie.net/lotr/images/8/8d/Gandalf-2.jpg/revision/latest?cb=20130209172436",
        "url" : "gandalf"
    },

    {
        "name": "Bilbo Baggins",
        "description": "Bilbo Baggins was a Hobbit of the Shire, the main protagonist of The Hobbit and a secondary character in The Lord of the Rings. Gandalf suggested Bilbo Baggins to be hired by Thorin and Company to be their burglar in the Quest of Erebor, and later fought in the Battle of the Five Armies. Bilbo was also one of the bearers of the One Ring, and the first to voluntarily give it up, although with some difficulty. He wrote many of his adventures in a book he called There and Back Again. Bilbo adopted Frodo Baggins as his nephew after his parents, Drogo Baggins and Primula Brandybuck, drowned in the Brandywine River. ",
        "image_source": "https://vignette.wikia.nocookie.net/lotr/images/b/b6/The_Hobbit_wallpaper_48.jpg/revision/latest?cb=20131112182330",
        "url" : "bilbo"
        
    }
]